artillery/banking-performance.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 2
      name: "Warm-up"
    # Ramp-up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Ramp-up"
    # Sustained load phase
    - duration: 120
      arrivalRate: 20
      name: "Sustained load"
    # Spike test
    - duration: 30
      arrivalRate: 50
      name: "Spike test"
    # Cool-down phase
    - duration: 30
      arrivalRate: 10
      name: "Cool-down"
  plugins:
    expect: {}
  processor: "./artillery/banking-processor.js"
  variables:
    # These should be set via environment or config file
    authToken: "{{ $processEnvironment.AUTH_TOKEN }}"
    companyId: "{{ $processEnvironment.COMPANY_ID }}"
    bankAccountId: "{{ $processEnvironment.BANK_ACCOUNT_ID }}"

scenarios:
  # Test transaction listing
  - name: "List Bank Transactions"
    weight: 40
    flow:
      - get:
          url: "/api/banking/transactions"
          headers:
            Cookie: "next-auth.session-token={{ authToken }}"
            x-company-id: "{{ companyId }}"
          capture:
            - json: "$.data[0]._id"
              as: "transactionId"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data
            - hasProperty: pagination

  # Test reconciliation suggestions
  - name: "Get Reconciliation Suggestions"
    weight: 30
    flow:
      - get:
          url: "/api/banking/reconciliation/suggestions?bankAccountId={{ bankAccountId }}&limit=10"
          headers:
            Cookie: "next-auth.session-token={{ authToken }}"
            x-company-id: "{{ companyId }}"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: suggestions

  # Test transaction sync
  - name: "Sync Bank Transactions"
    weight: 10
    flow:
      - post:
          url: "/api/banking/sync"
          headers:
            Cookie: "next-auth.session-token={{ authToken }}"
            x-company-id: "{{ companyId }}"
            Content-Type: "application/json"
          json:
            bankAccountId: "{{ bankAccountId }}"
          expect:
            - statusCode: [200, 201]
            - contentType: json

  # Test reconciliation export
  - name: "Export Reconciliation Report (PDF)"
    weight: 10
    flow:
      - get:
          url: "/api/banking/reconciliation/export?format=pdf&bankAccountId={{ bankAccountId }}"
          headers:
            Cookie: "next-auth.session-token={{ authToken }}"
            x-company-id: "{{ companyId }}"
          expect:
            - statusCode: 200
            - contentType: pdf

  # Test reconciliation export Excel
  - name: "Export Reconciliation Report (Excel)"
    weight: 10
    flow:
      - get:
          url: "/api/banking/reconciliation/export?format=excel&bankAccountId={{ bankAccountId }}"
          headers:
            Cookie: "next-auth.session-token={{ authToken }}"
            x-company-id: "{{ companyId }}"
          expect:
            - statusCode: 200
            - contentType: "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet"